; domain
(define (domain chesscapture)

(:types obstacle robot location)

(:predicates
      (at ?rob - robot ?from - location)
      (handEmpty)
      (holding ?rob - robot ?obs - obstacle)
      (in ?obs - obstacle ?from - location)
      (clear ?loc - location)
      (valid_zone ?loc - location)
      (is_home ?loc - location)
)

(:action move
   :parameters (?rob - robot ?from - location ?to - location)
   :precondition  (and  (at ?rob ?from)
                        (or (is_home ?from) (is_home ?to)) 
                  )
   :effect  (and  (at ?rob ?to)
                  (not (at ?rob ?from))
            )
)

(:action pick
   :parameters (?rob - robot ?obs - obstacle ?from - location)
   :precondition  (and  (handEmpty)
                        (in ?obs ?from)
                        (at ?rob ?from)
                  )
   :effect  (and  (holding ?rob ?obs)
                  (not (handEmpty))
                  (not (in ?obs ?from)) 
                  (clear ?from)         
            )
)

(:action place
   :parameters (?rob - robot ?obs - obstacle ?to - location)
   :precondition  (and  (holding ?rob ?obs)
                        (at ?rob ?to)
                        (clear ?to)
                        (valid_zone ?to)
                  )
   :effect  (and  (handEmpty)
                  (in ?obs ?to)
                  (not (holding ?rob ?obs))
                  (not (clear ?to))
            )
)

)

; problem
(define (problem chess_pawn_capture)

(:domain chesscapture)

(:objects
    e4 d5 graveyard home - location
    peon_negro peon_blanco - obstacle
    ur3a - robot
)

(:init
    (in peon_negro d5)
    (in peon_blanco e4)
    (at ur3a home)
    (handEmpty)
    (clear graveyard)
    (clear home)
    (is_home home) 
    (valid_zone e4)
    (valid_zone d5)
    (valid_zone graveyard)
)

(:goal
    (and  (in peon_negro graveyard)
          (in peon_blanco d5)
          (at ur3a home)
    )
)

)

; plan
1. (move ur3a home d5)
   deleted: (at ur3a home)
   added: (at ur3a d5)
   goals met: 0 of 3
2. (pick ur3a peon_negro d5)
   deleted: (handempty) (in peon_negro d5)
   added: (holding ur3a peon_negro) (clear d5)
   goals met: 0 of 3
3. (move ur3a d5 home)
   deleted: (at ur3a d5)
   added: (at ur3a home)
   goals met: 1 of 3
4. (move ur3a home graveyard)
   deleted: (at ur3a home)
   added: (at ur3a graveyard)
   goals met: 0 of 3
5. (place ur3a peon_negro graveyard)
   deleted: (holding ur3a peon_negro) (clear graveyard)
   added: (handempty) (in peon_negro graveyard)
   goals met: 1 of 3
6. (move ur3a graveyard home)
   deleted: (at ur3a graveyard)
   added: (at ur3a home)
   goals met: 2 of 3
7. (move ur3a home e4)
   deleted: (at ur3a home)
   added: (at ur3a e4)
   goals met: 1 of 3
8. (pick ur3a peon_blanco e4)
   deleted: (handempty) (in peon_blanco e4)
   added: (holding ur3a peon_blanco) (clear e4)
   goals met: 1 of 3
9. (move ur3a e4 home)
   deleted: (at ur3a e4)
   added: (at ur3a home)
   goals met: 2 of 3
10. (move ur3a home d5)
   deleted: (at ur3a home)
   added: (at ur3a d5)
   goals met: 1 of 3
11. (place ur3a peon_blanco d5)
   deleted: (holding ur3a peon_blanco) (clear d5)
   added: (handempty) (in peon_blanco d5)
   goals met: 2 of 3
12. (move ur3a d5 home)
   deleted: (at ur3a d5)
   added: (at ur3a home)
   goals met: 3 of 3
